#+TITLE: emacs-jupyter remote debugging
#+roam_tags: CDN

** gcp configuration

You may like to run =gcloud auth login= ( [[https://cloud.google.com/sdk/gcloud/reference/auth/login][auth login docs]] ). This is an interactive process that launches oauth for your google account in the web browser so I think it is best to do it from a terminal though it may be possible to run it in org-babel.

#+BEGIN_SRC sh :session gcpsetup :results output verbatim replace :exports both
gcloud config configurations list
#+END_SRC

#+BEGIN_SRC sh :session gcpsetup :results output verbatim replace :exports both
gcloud config configurations describe quarere
#+END_SRC

#+RESULTS:
: is_active: true
: name: quarere
: properties:
:   compute:
:     region: us-central1
:     zone: us-central1-f
:   core:
:     account: camrn86@gmail.com
:     project: quarere

** launch container image

Deploy a vm based on the container =cameronraysmith/notebooks:latest=.

#+BEGIN_SRC sh :session gcpsetup :results output verbatim replace :exports code
gcloud compute instances create-with-container notebooks-vm \
    --container-image registry.hub.docker.com/cameronraysmith/notebooks:latest \
    --container-restart-policy on-failure \
    --container-privileged \
    --container-stdin \
    --container-tty \
    --container-mount-host-path mount-path=/home/jupyter,host-path=/tmp,mode=rw \
    --machine-type n1-standard-1 \
    --boot-disk-size 50GB \
    --preemptible
#+END_SRC

Setup ssh with your new instance

#+BEGIN_SRC sh :session gcpsetup :results output verbatim replace :exports code
gcloud compute config-ssh
cat ~/.ssh/config | grep "Host notebooks"
#+END_SRC

#+RESULTS:
: You should now be able to use ssh/scp with your instances.
: For example, try running:
: ssh notebooks-vm.us-central1-f.quarere
: Host notebooks-vm.us-central1-f.quarere

You can =ssh= into the host machine or the container using the various commands below.

#+BEGIN_EXAMPLE sh
gcloud compute ssh notebooks-vm # into host machine
ssh notebooks-vm.us-central1-f.quarere docker ps -aqf "name=klt-notebooks-vm-cjme" # check the container ID
gcloud compute ssh notebooks-vm --container klt-notebooks-vm-cjme # use gcloud ssh with --dry-run to print the command
ssh -t notebooks-vm.us-central1-f.quarere -- sudo docker exec -it klt-notebooks-vm-cjme /bin/sh # this takes you directly into the container
#+END_EXAMPLE

Of course you can stop and start the machine with

#+BEGIN_EXAMPLE sh
gcloud compute instances stop notebooks-vm
gcloud compute instances start notebooks-vm
#+END_EXAMPLE

** Setup remote container host machine

We already setup the container named =notebooks-vm= so all we need to do to begin with is to start it up.

#+BEGIN_SRC sh :results output verbatim replace :exports both :async yes
gcloud compute instances start notebooks-vm
#+END_SRC

#+RESULTS:

Check that our instance is indeed running

#+BEGIN_SRC sh :results output verbatim replace :exports both
gcloud compute instances list
#+END_SRC

#+RESULTS:
: NAME          ZONE           MACHINE_TYPE   PREEMPTIBLE  INTERNAL_IP  EXTERNAL_IP   STATUS
: notebooks     us-central1-c  n1-standard-1               10.128.0.22                TERMINATED
: notebooks-vm  us-central1-f  n1-standard-1  true         10.128.0.26  35.223.72.41  RUNNING

Make sure the correct ip address is entered into our =.ssh/config= file.
#+BEGIN_SRC sh :results output verbatim replace :exports both
gcloud compute config-ssh
#+END_SRC

#+RESULTS:
: You should now be able to use ssh/scp with your instances.
: For example, try running:
:
:   $ ssh notebooks-vm.us-central1-f.quarere
:

Inspect the IP address we find in our =.ssh/config= file

#+BEGIN_SRC sh :results output verbatim replace :exports both
grep HostName ~/.ssh/config
#+END_SRC

#+RESULTS:
:     HostName 35.224.59.240
:     HostName 35.223.72.41

*** Execute commands on the remote container host machine
#+BEGIN_SRC sh :session notebookshost :results output verbatim replace :exports both :dir /ssh:notebooks-vm.us-central1-f.quarere:
hostname --long
#+END_SRC

#+RESULTS:
:
: $ notebooks-vm.us-central1-f.c.quarere.internal

#+BEGIN_SRC sh :session notebookshost :results output verbatim replace :exports both :dir /ssh:notebooks-vm.us-central1-f.quarere:
docker container ls
#+END_SRC

#+RESULTS:
: CONTAINER ID        IMAGE                                                                COMMAND                  CREATED              STATUS              PORTS               NAMES
: 7e5e8974adc8        registry.hub.docker.com/cameronraysmith/notebooks:latest             "/bin/sh -c 'jupyter…"   About a minute ago   Up About a minute                       klt-notebooks-vm-cjme
: 5a480b60af52        gcr.io/stackdriver-agents/stackdriver-logging-agent:0.2-1.5.33-1-1   "/entrypoint.sh /usr…"   About a minute ago   Up About a minute                       stackdriver-logging-agent

#+BEGIN_SRC sh :session notebookshost :results output verbatim replace :exports both :dir /ssh:notebooks.us-central1-c.quarere:
docker container ls
#+END_SRC

#+RESULTS:
:
: $ CONTAINER ID        IMAGE                              COMMAND                  CREATED             STATUS              PORTS                      NAMES
: caadc9a126bb        gcr.io/inverting-proxy/agent       "/bin/sh -c '/opt/bi…"   2 hours ago         Up 2 hours                                     proxy-agent
: 8080/tcp   payload-container

* Run shell commands on the remote container
:PROPERTIES:
:header-args: :results output verbatim replace :session notebookscontainer :dir /ssh:notebooks-vm.us-central1-f.quarere|docker:klt-notebooks-vm-cjme:  :exports both  :eval never-export
:END:

To switch between two available configurations, choose one of the lines below to copy to the =:PROPERTIES:= drawer for this section.
#+BEGIN_EXAMPLE lisp
:header-args: :results output verbatim replace :session notebookscontainer :dir /ssh:notebooks-vm.us-central1-f.quarere|docker:klt-notebooks-vm-cjme:  :exports both  :eval never-export
:header-args: :results output verbatim replace :session notebookscontainer :dir /ssh:notebooks.us-central1-c.quarere|docker:payload-container:  :exports both  :eval never-export
#+END_EXAMPLE

In order to connect to the remote host followed by the docker container we specify the directory as =ssh:notebooks-vm= (including the extra details we got from =gcloud compute ssh-config=) followed by =docker:containername= where we got the container name from running =docker container ls= on the remote machine.

#+BEGIN_SRC sh
echo $JUPYTER_PATH
#+END_SRC

#+RESULTS:
:
: $

#+BEGIN_SRC sh
head -3 /proc/self/cgroup
#+END_SRC

#+RESULTS:
:
: $ 12:blkio:/docker/0313f41d52ad7945b5f9687efc0d1e3431e531eb7a29c8d7eecf5fddcbef0f93
: 11:net_cls,net_prio:/docker/0313f41d52ad7945b5f9687efc0d1e3431e531eb7a29c8d7eecf5fddcbef0f93
: 10:hugetlb:/docker/0313f41d52ad7945b5f9687efc0d1e3431e531eb7a29c8d7eecf5fddcbef0f93

Check the working directory and the list of jupyter kernels
#+BEGIN_EXAMPLE lisp
(push "-e" docker-tramp-docker-options)
(push "-e" "JUPYTER_PATH=/home/jovyan/.local/share/jupyter:/usr/local/share/jupyter:/usr/share/jupyter" docker-tramp-docker-options)
#+END_EXAMPLE

#+BEGIN_SRC sh
echo $JUPYTER_PATH
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh
jupyter kernelspec list
#+END_SRC

#+RESULTS:
: Available kernels:
:   ir           /home/jovyan/.local/share/jupyter/kernels/ir
:   julia-1.5    /home/jovyan/.local/share/jupyter/kernels/julia-1.5
:   maxima       /home/jovyan/.local/share/jupyter/kernels/maxima
:   python3      /usr/share/jupyter/kernels/python3

If you try to make use of an existing session on the docker container to run one of the =emacs-jupyter= kernels, you find that there is a different usage of the TRAMP remote path specification in the =:dir= property for the =sh= language of babel and with the =:session= property in the =emacs-jupyter= /language/ of babel. This is the error I got the first time I tried this with the TRAMP remote path specification in =:dir=:

#+BEGIN_EXAMPLE python
: FileNotFoundErrorTraceback (most recent call last)
: <ipython-input-1-d4b8d99aef95> in <module>
:       1 import os
:       2 __JUPY_saved_dir = os.getcwd()
: ----> 3 os.chdir("/ssh:notebooks-vm.us-central1-f.quarere|docker:klt-notebooks-vm-cjme:/home/jovyan/")
:       4 try:
:       5     get_ipython().run_cell("""x = 'foo'
:
: FileNotFoundError: [Errno 2] No such file or directory: '/ssh:notebooks-vm.us-central1-f.quarere|docker:klt-notebooks-vm-cjme:/home/jovyan/'
#+END_EXAMPLE

** Run python session on the remote container
:PROPERTIES:
:header-args: :results output verbatim replace :session notebookscontainer-python :dir /ssh:notebooks-vm.us-central1-f.quarere|docker:klt-notebooks-vm-cjme:  :exports both  :eval never-export
:END:

The default properties that should apply to this section are

#+BEGIN_EXAMPLE elisp
:header-args: :results output verbatim replace :session notebookscontainer-python :dir /ssh:notebooks-vm.us-central1-f.quarere|docker:klt-notebooks-vm-cjme:/home/jovyan/  :exports both  :eval never-export
#+END_EXAMPLE

In order to connect to the remote host followed by the docker container we specify the directory as =ssh:notebooks-vm= (including the extra details we got from =gcloud compute ssh-config=) followed by a =|= and then =docker:containername= where we got the container name from running =docker container ls= on the remote machine.

#+BEGIN_SRC python
x = 'foo'
y = 'bar'
print(x + ' ' + y)
#+END_SRC

#+RESULTS:
: foo bar

#+BEGIN_SRC python
x = 1 + 1
print(x)
#+END_SRC

#+RESULTS:
: 2

